using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Services.Storage
{
    /*
    в хранилище добавить readonly список для хранение клиентов банка,
    реализуем публичный метод добавления новых клиентов;















    ● экземпляр готового хранилища передаем через параметры
    конструктора в сервис работы с клиентами;
     














    ● в сервисе реализуем метод получения выборки из хранилища с
    применением фильтра: ФИО, номер телефона, номер паспорта,
    диапазон дат рождения.












    ● в классе тестов проверяем работу системы, добавляем клиентов в
    хранилище и делаем выборки из нее;














    ● найдите самого молодого клиента;











    ● найдите самого старого клиента;











    ● вычислите средний возраст клиентов;









    ● самостоятельно повторить работу на примере сотрудников банка.
     







     */
    internal class ClientStorage
    {
    }
}
